Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If you want to deploy every exposed `AbstractVerticle`, you can use:
ja_jp: 露出しているすべての `AbstractVerticle` をデプロイしたい場合は、次のようにします。

source: If you want to deploy your application somewhere (typically in a container), you need to deploy the whole `quarkus-app` directory.
ja_jp: アプリケーションをどこかに ( 典型的にはコンテナーに ) デプロイしたい場合は、 `quarkus-app` ディレクトリ全体をデプロイする必要があります。

source: If you want to deserialize a list of fruits, you need to create a deserializer with a Jackson `TypeReference` denoted the generic collection used.
ja_jp: fruits のリストをデシリアライズしたい場合は、使用する一般的なコレクションを表す Jackson `TypeReference` を持つデシリアライザーを作成する必要があります。

source: If you want to deserialize a list of fruits, you need to create a deserializer with a `Type` denoted the generic collection used.
ja_jp: fruits のリストをデシリアライズしたい場合は、使用する一般的なコレクションを表す `Type` を持つデシリアライザーを作成する必要があります。

source: If you want to disable HTTP/2 you can set:
ja_jp: HTTP/2 を無効にしたい場合は、以下を設定します。

source: If you want to disable the JDBC datasource explicitly, use:
ja_jp: JDBC データソースを明示的に無効にしたい場合は、以下を使用します。

source: If you want to disable the reactive datasource explicitly, use:
ja_jp: リアクティブデータソースを明示的に無効にしたい場合は、以下のようにします。

source: If you want to disable this behavior and fetch resources during startup, you can use the following configuration:
ja_jp: この動作を無効にして、起動時にリソースをフェッチしたい場合は、以下の設定を使用します。

source: If you want to force compression to take place in a container, you can set `quarkus.native.compression.container-build` to `true` (or `false` to explicitly not run compression in a container).
ja_jp: コンテナー内で圧縮を強制的に実行したい場合は、 `quarkus.native.compression.container-build` を `true` に設定できます (コンテナー内で圧縮を実行しないことを明示的に示す場合は `false` )。

source: If you want to generate a CronJob resource, you need to add the following property by using the `application.properties` file:
ja_jp: CronJobリソースを生成したい場合、 `application.properties` ファイルを使用して以下のプロパティを追加する必要があります：

source: If you want to generate a CronJob resource, you need to add the following property via the `application.properties`:
ja_jp: CronJob リソースを生成したい場合、 `application.properties` で以下のプロパティーを追加する必要があります。

source: If you want to generate a Job resource, you need to add the following property by using the `application.properties`:
ja_jp: Job リソースを生成したい場合、 `application.properties` を使って以下のプロパティを追加する必要があります：

source: If you want to generate a Job resource, you need to add the following property to the `application.properties`:
ja_jp: Job リソースを生成する場合は、 `application.properties` で以下のプロパティーを追加する必要があります。

source: If you want to generate a Job resource, you need to add the following property via the `application.properties`:
ja_jp: Job リソースを生成する場合は、 `application.properties` で以下のプロパティを追加する必要があります。

source: If you want to get started with Quarkus or write something quickly, Quarkus Scripting with jbang lets you do that. No Maven, no Gradle - just a Java file. In this guide we outlined the very basics on using Quarkus with JBang; if you want to learn more about what JBang can do, go see https://jbang.dev.
ja_jp: Quarkus を使い始めたい、または何かを素早くコーディングしたい場合、jbang による Quarkus スクリプティングを使用すると便利です。Java ファイルだけでよく、Maven や Gradle は必要ありません。このガイドでは、JBang を使用した Quarkus の基本的な使い方を説明しました。JBang の機能に関する詳細は、 https://jbang.dev を参照してください。

source: If you want to get the most performance our of your writer, you can extend the link:{resteasy-reactive-api}/org/jboss/resteasy/reactive/server/spi/ServerMessageBodyWriter.html[`ServerMessageBodyWriter`] instead of link:{jaxrsapi}/jakarta/ws/rs/ext/MessageBodyWriter.html[`MessageBodyWriter`] where you will be able to use less reflection and bypass the blocking IO layer:
ja_jp: ライターのパフォーマンスを最大限に高めたい場合は、 link:{jaxrsapi}/jakarta/ws/rs/ext/MessageBodyWriter.html[`MessageBodyWriter`] の代わりに link:{resteasy-reactive-api}/org/jboss/resteasy/reactive/server/spi/ServerMessageBodyWriter.html[`ServerMessageBodyWriter`] を拡張できます。こちらでは、リフレクションの使用を減らし、ブロッキング IO レイヤーをバイパスできます。

source: If you want to get the most performance our of your writer, you can extend the link:{resteasy-reactive-api}/org/jboss/resteasy/reactive/server/spi/ServerMessageBodyWriter.html[`ServerMessageBodyWriter`] instead of link:{jaxrsapi}/javax/ws/rs/ext/MessageBodyWriter.html[`MessageBodyWriter`] where you will be able to use less reflection and bypass the blocking IO layer:
ja_jp: ライターのパフォーマンスを最大限に高めたい場合は、 link:{jaxrsapi}/javax/ws/rs/ext/MessageBodyWriter.html[`MessageBodyWriter`] の代わりに link:{resteasy-reactive-api}/org/jboss/resteasy/reactive/server/spi/ServerMessageBodyWriter.html[`ServerMessageBodyWriter`] を拡張できます。こちらでは、リフレクションの使用を減らし、ブロッキング IO レイヤーをバイパスできます。

source: If you want to get the most performance out of your writer, you can extend the link:{resteasy-reactive-api}/org/jboss/resteasy/reactive/server/spi/ServerMessageBodyWriter.html[`ServerMessageBodyWriter`] instead of link:{jaxrsapi}/jakarta/ws/rs/ext/MessageBodyWriter.html[`MessageBodyWriter`] where you will be able to use less reflection and bypass the blocking IO layer:
ja_jp: ライターのパフォーマンスを最大限に高める場合は、link:{jaxrsapi}/jakarta/ws/rs/ext/MessageBodyWriter.html[`MessageBodyWriter`] ではなく link:{resteasy-reactive-api}/org/jboss/resteasy/reactive/server/spi/ServerMessageBodyWriter.html[`ServerMessageBodyWriter`] を拡張できます。こちらでは、リフレクションの使用を減らし、ブロッキング IO レイヤーをバイパスできます。

source: If you want to go further, check the documentation of https://smallrye.io/smallrye-reactive-messaging[SmallRye Reactive Messaging], the implementation used in Quarkus.
ja_jp: さらに詳しく知りたい場合は、Quarkusで使用されている実装、 https://smallrye.io/smallrye-reactive-messaging[SmallRye Reactive Messaging] のドキュメントを確認してください。

source: If you want to go further, you can check the link:{rm_doc}[SmallRye Reactive Messaging] documentation, which has in-depth documentation for each of these concepts and more.
ja_jp: さらに詳しく知りたい場合は、リンク:{rm_doc}[SmallRye Reactive Messaging] のドキュメントを参照してください。 これには、それぞれのコンセプトなどに関する詳細なドキュメントが含まれています。

source: If you want to go native, there's an environment variable that must be set for native GraalVM deployments. If you look at `sam.native.yaml` you'll see this:
ja_jp: ネイティブを利用する場合は、ネイティブのGraalVMデプロイメント用に設定する必要のある環境変数があります。 `sam.native.yaml` を見ると、次のことがわかります。

source: If you want to hand code raw events for the AWS HTTP API, the AWS Lambda library has the request event type which is `com.amazonaws.services.lambda.runtime.events.APIGatewayV2HTTPEvent` and the response event type of `com.amazonaws.services.lambda.runtime.events.APIGatewayV2HTTPResponse`. This corresponds to the `quarkus-amazon-lambda-http` extension and the AWS HTTP API.
ja_jp: AWS HTTP API の生のイベントをハンドコードする場合、AWS Lambda ライブラリーのリクエストイベントタイプは `com.amazonaws.services.lambda.runtime.events.APIGatewayV2HTTPEvent` で、レスポンスイベントタイプは `com.amazonaws.services.lambda.runtime.events.APIGatewayV2HTTPResponse` です。これは、 `quarkus-amazon-lambda-http` エクステンションおよび AWS HTTP API に対応します。

source: If you want to hand code raw events for the AWS HTTP API, the AWS Lambda library has the request event type, which is `com.amazonaws.services.lambda.runtime.events.APIGatewayV2HTTPEvent`, and the response event type of `com.amazonaws.services.lambda.runtime.events.APIGatewayV2HTTPResponse`. This corresponds to the `quarkus-amazon-lambda-http` extension and the AWS HTTP API.
ja_jp: AWS HTTP API の生のイベントをハンドコードする場合、AWS Lambda ライブラリーのリクエストイベントタイプは `com.amazonaws.services.lambda.runtime.events.APIGatewayV2HTTPEvent` で、レスポンスイベントタイプは `com.amazonaws.services.lambda.runtime.events.APIGatewayV2HTTPResponse` です。これは、 `quarkus-amazon-lambda-http` エクステンションおよび AWS HTTP API に対応します。

source: If you want to hand code raw events for the AWS REST API, Quarkus has its own implementation: `io.quarkus.amazon.lambda.http.model.AwsProxyRequest` and `io.quarkus.amazon.lambda.http.model.AwsProxyResponse`. This corresponds to `quarkus-amazon-lambda-rest` extension and the AWS REST API.
ja_jp: AWS REST API の生のイベントをハンドコードする場合、Quarkus には独自の実装 (`io.quarkus.amazon.lambda.http.model.AwsProxyRequest` および `io.quarkus.amazon.lambda.http.model.AwsProxyResponse`) があります。これは、 `quarkus-amazon-lambda-rest` エクステンションおよび AWS REST API に対応します。

source: If you want to handle the inactive case gracefully, you should always inject possibly inactive beans using `Instance<>`. You also need to check before obtaining the actual instance:
ja_jp: 非アクティブなケースを適切に処理する必要がある場合は、必ず `Instance<>` を使用して非アクティブな可能性のある Bean を注入する必要があります。 実際のインスタンスを取得する前に、以下も確認する必要があります。

source: If you want to help improve the language coverage see the readme file in one of the following repositories:
ja_jp: 言語のカバレッジの改善に協力したい場合は、次のリポジトリのいずれかにある readme ファイルを参照してください:

source: If you want to index Hibernate ORM entities, see xref:hibernate-search-orm-elasticsearch.adoc[this dedicated guide] instead.
ja_jp: Hibernate ORM エンティティーのインデックスを作成したい場合は、 代わりに、xref:hibernate-search-orm-elasticsearch.adoc[こちらの専用ガイド] を参照してください。

source: If you want to index entities that are not Hibernate ORM entities, see xref:hibernate-search-standalone-elasticsearch.adoc[this dedicated guide] instead.
ja_jp: Hibernate ORM エンティティーではないエンティティーをインデックス化する必要がある場合は、xref:hibernate-search-standalone-elasticsearch.adoc[こちらの専用ガイド] を参照してください。

source: If you want to inject/test a `@SessionScoped` bean then it's very likely that the session context is not active and you would receive the `ContextNotActiveException` when a method of the injected bean is invoked. However, it's possible to use the `@io.quarkus.test.ActivateSessionContext` interceptor binding to activate the session context for a specific business method. Please read the javadoc for futher limitations.
ja_jp: `@SessionScoped` Bean を注入/テストする場合、セッションコンテキストがアクティブではない可能性が高く、注入された Bean のメソッドが呼び出されたときに `ContextNotActiveException` を受け取ることになります。ただし、 `@io.quarkus.test.ActivateSessionContext` インターセプターバインディングを使用して、特定のビジネスメソッドのセッションコンテキストをアクティブ化することは可能です。その他の制限については、javadoc を参照してください。

source: If you want to interact with beans that requires a request scope, simply add the `@ActivateRequestContext` annotation on your `run()` method. This let `run()` have access to methods like `listAll()` and `query*` methods on a Panache Entity. Without it you will eventually get a `ContextNotActiveException` when accessing such classes/beans.
ja_jp: これにより、 `run()` は Panache Entity 上の `listAll()` や `query*` のようなメソッドにアクセスできるようになります。これがないと、そのようなクラスやBeanにアクセスするときに、最終的には `ContextNotActiveException` に直面することになります。

source: If you want to interact with beans that requires a request scope, simply add the `@ActivateRequestContext` annotation on your `run()` method. This let `run()` have access to methods like `listAll()` and `query*` methods on a Panache Entity. Without it, you will eventually get a `ContextNotActiveException` when accessing such classes/beans.
ja_jp: リクエストスコープを必要とするBeanと対話したい場合は、 `run()` メソッドに `@ActivateRequestContext` アノテーションを追加するだけです。 これにより、 `run()` は Panache Entity の `listAll()` や `query*` メソッドにアクセスすることができます。 これがないと、そのようなクラスやBeanにアクセスしたときに `ContextNotActiveException` を受け取ることになります。

source: If you want to keep Dev Service containers running *after a dev mode session or test suite execution* to reuse them in the next dev mode session or test suite execution, this is possible as well. Just enable https://java.testcontainers.org/features/reuse/[TestContainers reuse] by inserting this line in one of your https://java.testcontainers.org/features/configuration/[TestContainers configuration file] (generally `~/.testcontainers.properties` or `C:/Users/myuser/.testcontainers.properties`):
ja_jp: Dev Service コンテナを *開発モードセッションやテストスイート実行* 後も実行したままにして、 次の開発モードセッションやテストスイート実行時に再利用することも できます。 link:https://java.testcontainers.org/features/reuse/[TestContainers の再利用] を有効にするには、 link:https://java.testcontainers.org/features/configuration/[TestContainers の設定ファイル] (通常は `~/.testcontainers.properties` あるいは `C:/Users/myuser/.testcontainers.properties`) に次の行を記述します。

source: If you want to know additional information about the incoming Cloud Event, you can inject the `io.quarkus.funqy.knative.events.CloudEvent` interface using the Funqy `@Context` annotation. The `CloudEvent` interface exposes information about the triggering event.
ja_jp: 受信したcloud eventに関する追加情報を知りたい場合は、Funqy `@Context` アノテーションを使用して `io.quarkus.funqy.knative.events.CloudEvent` インターフェースを注入することができます。 `CloudEvent` インターフェースは、トリガーとなるイベントに関する情報を公開します。

source: If you want to know more about Mutiny, and the concepts behind it, check https://smallrye.io/smallrye-mutiny/latest/reference/why-is-asynchronous-important[the Mutiny Reference documentation].
ja_jp: Mutinyとそのコンセプトについてもっと知りたい方は、 https://smallrye.io/smallrye-mutiny/latest/reference/why-is-asynchronous-important[Mutinyのリファレンスドキュメント] を参照してください。

source: If you want to know more about Mutiny, and the concepts behind it, check https://smallrye.io/smallrye-mutiny/pages/philosophy[the Mutiny Philosophy].
ja_jp: Mutinyとそのコンセプトについてもっと知りたい方は、 link:https://smallrye.io/smallrye-mutiny/pages/philosophy[Mutiny Philosophy]をご覧ください。

source: If you want to know more about our LTS policy, the https://quarkus.io/blog/lts-releases/[LTS announcement] is a must read.
ja_jp: LTSポリシーについて詳しく知りたい場合は、 https://quarkus.io/blog/lts-releases/[LTSに関する発表] を必ずお読みください。

source: If you want to lead the development of an extension, see if it wasn't already https://github.com/quarkusio/quarkus/issues?q=is%3Aopen+is%3Aissue+label%3Akind%2Fextension-proposal[proposed on GitHub] or https://github.com/quarkusio/quarkus/issues/new/choose[create an Extension Proposal issue].
ja_jp: エクステンションの開発をリードしたい場合は、 link:https://github.com/quarkusio/quarkus/issues?q=is%3Aopen+is%3Aissue+label%3Akind%2Fextension-proposal[GitHub でまだ提案されていないかどうか] を確認したり、 link:https://github.com/quarkusio/quarkus/issues/new/choose[エクステンションの提案課題を作成] してみましょう。

source: If you want to make it available in production too, you can include the following configuration in your `application.properties`:
ja_jp: 本番環境でも利用できるようにしたい場合は、以下の設定を `application.properties` に追加してください。

source: If you want to make the annotation repeatable, the containing annotation type must be annotated with `@QuarkusTestResourceRepeatable`. For example, this would define a repeatable `@WithRepeatableTestResource` annotation.
ja_jp: アノテーションを繰り返し使えるようにするには、包含するアノテーション型に `@QuarkusTestResourceRepeatable` を付ける必要があります。例えば、この場合、繰り返し使える `@WithRepeatableTestResource` アノテーションを定義することになります。

source: If you want to manage manually your entity changes, then you can use a stateless session by switching to the `PanacheEntity.Reactive.Stateless` for your entity, and `PanacheRepository.Reactive.Stateless`:
ja_jp: エンティティーの変更を手動で管理したい場合は、エンティティーに `PanacheEntity.Reactive.Stateless` を、リポジトリーに `PanacheRepository.Reactive.Stateless` を使用することで、ステートレスセッションを使用できます。

source: If you want to measure the test coverage of the runtime module of an extension, specific JaCoCo configuration is needed in the deployment module:
ja_jp: エクステンションのランタイムモジュールのテストカバレッジを測定したい場合は、デプロイメントモジュールで特定の JaCoCo 設定が必要になります。

source: If you want to measure the test coverage of the runtime submodule, then a specific JaCoCo configuration is needed in the deployment module:
ja_jp: ランタイムサブモジュールのテストカバレッジを測定したい場合は、デプロイメントモジュールで特定の JaCoCo 設定が必要です。

source: If you want to override the default behavior, you can annotate a `jakarta.ws.rs.core.Application` subclass in your application with `@Blocking` or `@NonBlocking`, and this will set the default for every method that does not have an explicit annotation.
ja_jp: デフォルトの動作をオーバーライドしたい場合は、アプリケーション内の `jakarta.ws.rs.core.Application` サブクラスに `@Blocking` または `@NonBlocking` のアノテーションを付けると、明示的なアノテーションを持たないすべてのメソッドのデフォルトが設定されます。

source: If you want to override the default behaviour you can annotate a `javax.ws.rs.core.Application` subclass in your application with `@Blocking` or `@NonBlocking`, and this will set the default for every method that does not have an explicit annotation.
ja_jp: デフォルトの動作をオーバーライドする場合は、アプリケーションの `javax.ws.rs.core.Application` サブクラスに `@Blocking` または `@NonBlocking` のアノテーションを付けることができます。これにより、明示的なアノテーションを付与していないすべてのメソッドのデフォルトが設定されます。

source: If you want to perform authorization on all `SecurityIdentity` instances, you must do it manually. For example, to check if a permission is allowed at least by one of the identities, use a `@PermissionChecker` annotation:
ja_jp: すべての `SecurityIdentity` インスタンスに対して認可を実行したい場合は、手動で行う必要があります。たとえば、いずれかのアイデンティティーによってパーミッションが許可されているかどうかを確認するには、`@PermissionChecker` アノテーションを使用します:

source: If you want to perform logic on startup you should call `Quarkus.waitForExit()`, this method will wait until a shutdown is requested (either from an external signal like when you press `Ctrl+C` or because a thread has called `Quarkus.asyncExit()`).
ja_jp: 起動時にロジックを実行したい場合は、 `Quarkus.waitForExit()` を呼び出す必要があります。このメソッドは、シャットダウンが要求されるまで待機します( `Ctrl+C` を押したときのような外部シグナルや、スレッドが `Quarkus.asyncExit()` を呼び出したときのような外部シグナルのいずれか)。

source: If you want to process all the records from a topic (from its beginning), you need:
ja_jp: あるトピックの (先頭からの) すべてのレコードを処理したい場合は、以下を実行してください。

source: If you want to protect service applications by using OIDC Bearer token authentication, see xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer token authentication].
ja_jp: OIDC ベアラートークン認証を使用してサービスアプリケーションを保護したい場合は、xref:security-oidc-bearer-token-authentication.adoc[OIDC ベアラートークン認証] を参照してください。

source: If you want to protect web applications by using OIDC Authorization Code Flow authentication, see the xref:security-oidc-code-flow-authentication.adoc[OpenID Connect authorization code flow mechanism for protecting web applications] guide.
ja_jp: OIDC 認可コードフロー認証を使用して Web アプリケーションを保護する場合は、xref:security-oidc-code-flow-authentication.adoc[Web アプリケーションを保護するための OpenID Connect 認可コードフローメカニズム] ガイドを参照してください。

source: If you want to protect web applications by using OIDC authorization code flow authentication, see xref:security-oidc-code-flow-authentication-concept.adoc[OIDC authorization code flow authentication].
ja_jp: OIDC認可コードフロー認証を使用してWebアプリケーションを保護したい場合は、 xref:security-oidc-code-flow-authentication-concept.adoc[OIDC認可コードフロー] 認証を参照してください。

source: If you want to protect your service applications by using OIDC Bearer token authentication, see xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer token authentication].
ja_jp: OIDCベアラートークン認証を使用してサービスアプリケーションを保護したい場合は、 xref:security-oidc-bearer-token-authentication.adoc[OIDCベアラートークン認証] を参照してください。

source: If you want to provide a reactive health check, you can implement the `io.smallrye.health.api.AsyncHealthCheck` interface instead of the `org.eclipse.microprofile.health.HealthCheck` one. The `io.smallrye.health.api.AsyncHealthCheck` interface allows you to return a `Uni<HealthCheckResponse>`.
ja_jp: リアクティブなヘルスチェックを行いたい場合は、 `org.eclipse.microprofile.health.HealthCheck` の代わりに `io.smallrye.health.api.AsyncHealthCheck` のインターフェイスを実装することができます。 `io.smallrye.health.api.AsyncHealthCheck` インターフェイスでは、 `Uni<HealthCheckResponse>` を返すことができます。

source: If you want to record `Long` values you need this builder method because the default gauge records `Double` values.
ja_jp: デフォルトのゲージは `Double` 値を記録するため、 `Long` 値を記録する場合はこのビルダーメソッドが必要です。

source: If you want to record `Long` values you need this builder method because the default histogram records `Double` values.
ja_jp: デフォルトのヒストグラムは `Double` 値を記録するため、 `Long` 値を記録する場合はこのビルダーメソッドが必要です。

source: If you want to reference a fragment from the same template, skip the part before `$`, i.e. something like `{#include $item_aliases /}`.
ja_jp: 同じテンプレートからフラグメントを参照する場合は、`{#include $item_aliases /} ` など、`$` の前の部分をスキップします。

source: If you want to reuse containers for some Quarkus applications but not all of them, or some Dev Services but not all of them, you can disable this feature for a specific Dev Service by setting the configuration property xref:databases-dev-services.adoc#quarkus-datasource-config-group-dev-services-build-time-config_quarkus-datasource-devservices-reuse[`quarkus.datasource.devservices.reuse`/`quarkus.datasource."datasource-name".devservices.reuse`] to `false`.
ja_jp: すべてのQuarkusアプリケーションではなく一部のQuarkusアプリケーションでコンテナを再利用したい場合や、 すべてのQuarkusアプリケーションではなく一部のDev Serviceでコンテナを再利用したい場合は、 設定プロパティ xref:databases-dev-services.adoc#quarkus-datasource-config-group-dev-services-build-time-config_quarkus-datasource-devservices-reuse[quarkus.datasource.devservices.reuse/] xref:databases-dev-services.adoc#quarkus-datasource-config-group-dev-services-build-time-config_quarkus-datasource-devservices-reuse[quarkus.datasource."datasource-name".devservices.reuse ] を `false` に設定することで、特定のDev Serviceでこの機能を無効にすることができます。

source: If you want to reuse containers for some Quarkus applications but not all of them, or some Dev Services but not all of them, you can disable this feature for a specific Dev Service by setting the configuration property xref:elasticsearch-dev-services.adoc#quarkus-elasticsearch-rest-client_quarkus-elasticsearch-devservices_quarkus-elasticsearch-devservices-reuse[`quarkus.elasticsearch.devservices.reuse`] to `false`.
ja_jp: すべてではなく一部の Quarkus アプリケーションまたは Dev Service のみでコンテナーを再利用する必要がある場合は、特定の Dev Service で設定プロパティー xref:elasticsearch-dev-services.adoc#quarkus-elasticsearch-rest-client_quarkus-elasticsearch-devservices_quarkus-elasticsearch-devservices-reuse[`quarkus.elasticsearch.devservices.reuse`] を `false` に変更することで、この機能を無効にできます。

source: If you want to reuse containers for some Quarkus applications but not all of them, or some Dev Services but not all of them, you can disable this feature for a specific Dev Service by setting the configuration property xref:quarkus-datasource_quarkus-datasource-devservices_quarkus-datasource-devservices-reuse[`quarkus.datasource.devservices.reuse`/`quarkus.datasource."datasource-name".devservices.reuse`] to `false`.
ja_jp: すべてのQuarkusアプリケーションではなく一部のQuarkusアプリケーションでコンテナを再利用したい場合や、すべてのQuarkusアプリケーションではなく一部のDev Serviceでコンテナを再利用したい場合は、設定プロパティ xref:quarkus-datasource_quarkus-datasource-devservices_quarkus-datasource-devservices-reuse[`quarkus.datasource.devservices.reuse`/`quarkus.datasource."datasource-name".devservices.reuse`] を `false` に設定することで、特定のDev Serviceでこの機能を無効にすることができます。

source: If you want to run the server yourself using Docker, check out the 5-minute https://infinispan.org/get-started/[Getting stated with Infinispan] tutorial to run Infinispan Server
ja_jp: Dockerを使用して自分でサーバーを実行したい場合は、Infinispan サーバーを実行するための5分間の link:https://infinispan.org/get-started/[Infinispan入門] チュートリアルをチェックしてください。

source: If you want to send your logs to a centralized tool like Graylog, Logstash or Fluentd, you can follow the xref:centralized-log-management.adoc[Centralized log management guide].
ja_jp: ログをGraylog、Logstash、Fluentdなどの集中型ツールに送信したい場合は、 link:centralized-log-management[集中型ログ管理ガイド] に従ってください。

source: If you want to serve your templates via HTTP:
ja_jp: テンプレートを HTTP 経由で提供する場合:

source: If you want to share Open Source Quarkus extensions with others, it is a nice home for them. If you want to contribute to Quarkus, contributing to extensions hosted on the Quarkiverse Hub for which you have an interest is a good way to start.
ja_jp: オープンソースのQuarkusのエクステンションを他の人と共有したい場合は、そのための良い拠点となります。Quarkusに貢献したい場合は、Quarkiverse Hubでホストされているエクステンションのうち、興味のあるものに貢献するのが良い方法です。

source: If you want to shut down a running application and you are not in the main thread then you should call `Quarkus.asyncExit` in order to unblock the main thread and initiate the shutdown process.
ja_jp: 実行中のアプリケーションをシャットダウンしたい場合、メインスレッドにいない場合は、 `Quarkus.asyncExit` を呼び出してメインスレッドのブロックを解除し、シャットダウン処理を開始する必要があります。

source: If you want to shut down a running application and you are not in the main thread, then you should call `Quarkus.asyncExit` in order to unblock the main thread and initiate the shutdown process.
ja_jp: 実行中のアプリケーションをシャットダウンしたいが、メインスレッドにいない場合、メインスレッドのブロックを解除してシャットダウン処理を開始するために `Quarkus.asyncExit` を呼び出す必要があります。
